<a href="https://colab.research.google.com/github/mtsvi-moraes/mtsvi-moraes/blob/main/python_analise_dados_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Criando Series e DataFrames com Pandas:**

### **Importando bibliotecas:**

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

### **Criando e fazendo seleções em Series:**

In [3]:
objeto = pd.Series([1, 2, 3], index=['um', 'dois', 'tres'])

objeto[['um', 'dois']]

um      1
dois    2
dtype: int64

In [4]:
'tres' in objeto   #obs: Procura pelo índice

True

In [5]:
objeto.values

array([1, 2, 3])

In [6]:
objeto.index

Index(['um', 'dois', 'tres'], dtype='object')

### **Convertendo dicionários em Series**

Obs: As chaves se tornam índices e os valores as linhas

In [7]:
estados = {'SP': 44000000, 'MG': 20000000, 'RG': 6748000, 'AM': 3874000, 'PR': 11000000}
estados_br = pd.Series(estados)
estados_br

SP    44000000
MG    20000000
RG     6748000
AM     3874000
PR    11000000
dtype: int64

**Atribuindo o índice de outra lista:**

In [8]:
nome_estados = ['Utah', 'SP', 'MG', 'RG', 'AM']
estados_gerais = pd.Series(estados, index=nome_estados)
estados_gerais

Utah           NaN
SP      44000000.0
MG      20000000.0
RG       6748000.0
AM       3874000.0
dtype: float64

In [9]:
estados_br + estados_gerais                 #Somando duas Series, é feito um join

AM       7748000.0
MG      40000000.0
PR             NaN
RG      13496000.0
SP      88000000.0
Utah           NaN
dtype: float64

**Identificando números nulos:**

In [10]:
estados_gerais.isnull()

Utah     True
SP      False
MG      False
RG      False
AM      False
dtype: bool

In [11]:
estados_gerais.notnull()

Utah    False
SP       True
MG       True
RG       True
AM       True
dtype: bool

**Nomeando Índices e Nomes:**

In [12]:
estados_gerais.index.name = 'Estados:'
estados_gerais

Estados:
Utah           NaN
SP      44000000.0
MG      20000000.0
RG       6748000.0
AM       3874000.0
dtype: float64

In [13]:
estados_gerais.name = 'Populacao'
estados_gerais

Estados:
Utah           NaN
SP      44000000.0
MG      20000000.0
RG       6748000.0
AM       3874000.0
Name: Populacao, dtype: float64

### **DataFrame:**

In [14]:
data = {'Estado': ['São Paulo', 'São Paulo', 'São Paulo', 'Minas Gerais', 'Minas Gerais', 'Minas Gerais'],
'Ano': [2000, 2005, 2010, 2000, 2010, 2020],
'População': [36974378, 39201179, 41223683, 17891494, 19597330, 21292666]}
dados = pd.DataFrame(data)
dados.head()

         Estado   Ano  População
0     São Paulo  2000   36974378
1     São Paulo  2005   39201179
2     São Paulo  2010   41223683
3  Minas Gerais  2000   17891494
4  Minas Gerais  2010   19597330

**Escolhendo colunas do jeito que eu quero:**

In [15]:
pd.DataFrame(data, columns=['Ano', 'Estado', 'População'])

    Ano        Estado  População
0  2000     São Paulo   36974378
1  2005     São Paulo   39201179
2  2010     São Paulo   41223683
3  2000  Minas Gerais   17891494
4  2010  Minas Gerais   19597330
5  2020  Minas Gerais   21292666

Obs: Caso não tenha a coluna que eu criei, ele preenche a coluna com NaN

In [16]:
pd.DataFrame(data, columns=['Ano', 'Estado', 'População', 'Renda'])

    Ano        Estado  População Renda
0  2000     São Paulo   36974378   NaN
1  2005     São Paulo   39201179   NaN
2  2010     São Paulo   41223683   NaN
3  2000  Minas Gerais   17891494   NaN
4  2010  Minas Gerais   19597330   NaN
5  2020  Minas Gerais   21292666   NaN

In [17]:
dados[['Ano']]

    Ano
0  2000
1  2005
2  2010
3  2000
4  2010
5  2020

**Criando uma nova coluna com os valores desejados:**

In [18]:
dados['Renda'] = 2000
dados

         Estado   Ano  População  Renda
0     São Paulo  2000   36974378   2000
1     São Paulo  2005   39201179   2000
2     São Paulo  2010   41223683   2000
3  Minas Gerais  2000   17891494   2000
4  Minas Gerais  2010   19597330   2000
5  Minas Gerais  2020   21292666   2000

In [19]:
valor = pd.Series([-1, 1, 2, -2], index=['Teste', 'Exemplo', 'Amostra', '14'])
dados['Renda'] = valor
dados

         Estado   Ano  População  Renda
0     São Paulo  2000   36974378    NaN
1     São Paulo  2005   39201179    NaN
2     São Paulo  2010   41223683    NaN
3  Minas Gerais  2000   17891494    NaN
4  Minas Gerais  2010   19597330    NaN
5  Minas Gerais  2020   21292666    NaN

**Criando uma coluna com uma variável booleana**

In [20]:
dados['Confere'] = dados['Ano'] == 2010
dados

         Estado   Ano  População  Renda  Confere
0     São Paulo  2000   36974378    NaN    False
1     São Paulo  2005   39201179    NaN    False
2     São Paulo  2010   41223683    NaN     True
3  Minas Gerais  2000   17891494    NaN    False
4  Minas Gerais  2010   19597330    NaN     True
5  Minas Gerais  2020   21292666    NaN    False

**Deletando colunas:**

In [21]:
del dados['Confere']
dados

         Estado   Ano  População  Renda
0     São Paulo  2000   36974378    NaN
1     São Paulo  2005   39201179    NaN
2     São Paulo  2010   41223683    NaN
3  Minas Gerais  2000   17891494    NaN
4  Minas Gerais  2010   19597330    NaN
5  Minas Gerais  2020   21292666    NaN

**Criando DataFrames a partir de dicionários:**

In [22]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [23]:
dados_new = pd.DataFrame(pop)
dados_new

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [24]:
dados_new.T #faz a transposição do DataFrame assim como no array NumPy

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

**Renomeando colunas e indices:**

In [25]:
dados_new.columns.name = 'Anos:'; dados_new.index.name = 'Estados'
dados_new

Anos:    Nevada  Ohio
Estados
2001        2.4   1.7
2002        2.9   3.6
2000        NaN   1.5

In [26]:
dados_new.index.is_unique    #Retorna true se o índice não tiver itens repetidos

True

### **Reorganizando novos índices e colunas do jeito que eu quero:**

In [27]:
obj = pd.Series(np.arange(1, 6), index=['Terceiro', 'Primeiro', 'Segundo', 'Quinto', 'Quarto'])
obj

Terceiro    1
Primeiro    2
Segundo     3
Quinto      4
Quarto      5
dtype: int64

Obs: Caso um novo índice não exista nos elementos que escolhi, ele cria uma nova coluna com NaN

In [28]:
obj2 = obj.reindex(['Primeiro', 'Segundo', 'Terceiro', 'Quarto', 'Quinto', '6º'])
pd.DataFrame(obj2)

            0
Primeiro  2.0
Segundo   3.0
Terceiro  1.0
Quarto    5.0
Quinto    4.0
6º        NaN

In [32]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [39]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [44]:
obj3.reindex(range(6), method='ffill')      #ffill Preenche o NaN com o valor encontrado no índice anterior (o índice anterior preenche pra frente o próximo NaN, por isso ffill(forward fill), bfill é o contrário)

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [45]:
obj3.reindex(range(6), method='bfill') #bfill Preenche o NaN com o valor encontrado no índice posterior (o indice após o NaN passa a preencher o valor de de NaN)

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [52]:
obj4 = pd.DataFrame(np.arange(1, 10).reshape(3, 3), index=['A', 'C', 'D'], columns=['Utah', 'Las Vegas', 'California'])
obj4

   Utah  Las Vegas  California
A     1          2           3
C     4          5           6
D     7          8           9

In [53]:
obj4.reindex(['A', 'B', 'C', 'D'], columns=['California', 'Las Vegas', 'Texas'])

   California  Las Vegas  Texas
A         3.0        2.0    NaN
B         NaN        NaN    NaN
C         6.0        5.0    NaN
D         9.0        8.0    NaN